---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ThermalProperties
source: html/029b61ca-ab28-be8b-b88a-5ad63c0db068.htm
---
# ThermalProperties Members

Causes the object to release immediately any resources it may be utilizing.